Mrklly/source/rs485_pinglian/stdlib/inc/hc32_bt.h
    func_ptr_t            pfnTim0Cb;        ///< Timer0中断服务回调函数[void function(void)]
    func_ptr_t            pfnTim1Cb;        ///< Timer1中断服务回调函数[void function(void)]
    func_ptr_t            pfnTim2Cb;        ///< Timer2中断服务回调函数[void function(void)]
}stc_bt_mode0_config_t;

/**
 ******************************************************************************
 ** \brief BaseTimer mode1 配置结构体定义(模式1)
 *****************************************************************************/
typedef struct stc_bt_mode1_config
{
    en_bt_work_mode_t     enWorkMode;       ///< 工作模式设置
    en_bt_cr_timclkdiv_t  enPRS;            ///< 预除频配置
    en_bt_cr_ct_t         enCT;             ///< 定时/计数功能选择
    en_bt_m1cr_oneshot_t  enOneShot;        ///< 单次测量/循环测量选择


    func_ptr_t          pfnTim0Cb;        ///< Timer0中断服务回调函数[void function(void)]
    func_ptr_t          pfnTim1Cb;        ///< Timer1中断服务回调函数[void function(void)]
    func_ptr_t          pfnTim2Cb;        ///< Timer2中断服务回调函数[void function(void)]
}stc_bt_mode1_config_t;

/**
 ******************************************************************************
 ** \brief PWC输入配置结构体定义(模式1)
 *****************************************************************************/
typedef struct stc_bt_pwc_input_config
{
    en_bt_mscr_ts_t          enTsSel;       ///< 触发输入源选择
    en_bt_m1_mscr_ia0s_t     enIA0Sel;      ///< CHA0输入选择
    en_bt_m1_mscr_ib0s_t     enIB0Sel;      ///< CHB0输入选择
    en_bt_port_polarity_t    enETRPhase;    ///< ETR相位选择
    en_bt_flt_t              enFltETR;      ///< ETR滤波设置
    en_bt_flt_t              enFltIA0;      ///< CHA0滤波设置
    en_bt_flt_t              enFltIB0;      ///< CHB0滤波设置
}stc_bt_pwc_input_config_t;

/**
 ******************************************************************************
 ** \brief BaseTimer mode23 配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_bt_mode23_config
{
    en_bt_work_mode_t         enWorkMode;       ///< 工作模式设置
    en_bt_m23cr_dir_t         enCntDir;         ///< 计数方向
    en_bt_cr_timclkdiv_t      enPRS;            ///< 时钟预除频配置
    en_bt_cr_ct_t             enCT;             ///< 定时/计数功能选择
    en_bt_m23cr_comp_t        enPWMTypeSel;     ///< PWM模式选择（独立/互补）
    en_bt_m23cr_pwm2s_t       enPWM2sSel;       ///< OCREFA双点比较功能选择
    boolean_t                 bOneShot;         ///< 单次触发模式使能/禁止
    boolean_t                 bURSSel;          ///< 更新源选择

    func_ptr_t                pfnTim0Cb;        ///< Timer0中断服务回调函数[void function(void)]
    func_ptr_t                pfnTim1Cb;        ///< Timer1中断服务回调函数[void function(void)]
    func_ptr_t                pfnTim2Cb;        ///< Timer2中断服务回调函数[void function(void)]
}stc_bt_mode23_config_t;

/**
 ******************************************************************************
 ** \brief GATE在PWM互补模式下捕获或比较功能 配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_bt_m23_gate_config
{
    en_bt_m23cr_csg_t        enGateFuncSel;      ///< Gate比较、捕获功能选择
    boolean_t                bGateRiseCap;       ///< GATE作为捕获功能时，上沿捕获有效控制
    boolean_t                bGateFallCap;       ///< GATE作为捕获功能时，下沿捕获有效控制
}stc_bt_m23_gate_config_t;

/**
 ******************************************************************************
 ** \brief CHA/CHB通道比较控制 配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_bt_m23_compare_config
{
    en_bt_m23_crch0_csa_csb_t  enCh0ACmpCap;     ///< CH0A比较/捕获功能选择
    en_bt_m23_fltr_ocm_t       enCH0ACmpCtrl;    ///< CH0A通道比较控制
    en_bt_port_polarity_t      enCH0APolarity;   ///< CH0A输出极性控制
    boolean_t                  bCh0ACmpBufEn;    ///< 比较A缓存功能 使能/禁止
    en_bt_m23_cisa_cisb_t      enCh0ACmpIntSel;  ///< CHA比较匹配中断选择

    en_bt_m23_crch0_csa_csb_t  enCh0BCmpCap;     ///< CH0B比较/捕获功能选择
    en_bt_m23_fltr_ocm_t       enCH0BCmpCtrl;    ///< CH0B通道比较控制
    en_bt_port_polarity_t      enCH0BPolarity;   ///< CH0B输出极性控制
    boolean_t                  bCH0BCmpBufEn;    ///< 比较B缓存功能 使能/禁止
    en_bt_m23_cisa_cisb_t      enCH0BCmpIntSel;  ///< CHB0比较匹配中断选择
}stc_bt_m23_compare_config_t;

/**
 ******************************************************************************
 ** \brief CHA/CHB通道捕获控制 配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_bt_m23_input_config
{
    en_bt_m23_crch0_csa_csb_t  enCh0ACmpCap;     ///< CH0A比较/捕获功能选择
    en_bt_m23_crch0_cfx_crx_t  enCH0ACapSel;     ///< CH0A捕获边沿选择
    en_bt_flt_t                enCH0AInFlt;      ///< CH0A通道捕获滤波控制
    en_bt_port_polarity_t      enCH0APolarity;   ///< CH0A输入相位

    en_bt_m23_crch0_csa_csb_t  enCh0BCmpCap;     ///< CH0B比较/捕获功能选择
    en_bt_m23_crch0_cfx_crx_t  enCH0BCapSel;     ///< HC0B捕获边沿选择
    en_bt_flt_t                enCH0BInFlt;      ///< CH0B通道捕获滤波控制
    en_bt_port_polarity_t      enCH0BPolarity;   ///< CH0B输入相位

}stc_bt_m23_input_config_t;

/**
 ******************************************************************************
 ** \brief ETR输入相位滤波配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_bt_m23_etr_input_config
{
    en_bt_port_polarity_t     enETRPolarity;  ///< ETR输入极性设置
    en_bt_flt_t               enETRFlt;       ///< ETR滤波设置
}stc_bt_m23_etr_input_config_t;

/**
 ******************************************************************************
 ** \brief 刹车BK输入相位滤波配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_bt_m23_bk_input_config
{
    boolean_t                 bEnBrake;         ///< 刹车使能
    boolean_t                 bEnVC0Brake;      ///< 使能VC0刹车
    boolean_t                 bEnVC1Brake;      ///< 使能VC1刹车
    boolean_t                 bEnSafetyBk;      ///< 使能safety刹车
    boolean_t                 bEnBKSync;        ///< TIM0/TIM1/TIM2刹车同步使能
    en_bt_m23_crch0_bks_t     enBkCH0AStat;     ///< 刹车时CHA端口状态设置
    en_bt_m23_crch0_bks_t     enBkCH0BStat;     ///< 刹车时CHB端口状态设置
    en_bt_port_polarity_t     enBrakePolarity;  ///< 刹车BK输入极性设置
    en_bt_flt_t               enBrakeFlt;       ///< 刹车BK滤波设置
}stc_bt_m23_bk_input_config_t;

/**
 ******************************************************************************
** \brief 死区功能配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_bt_m23_dt_config
{
    boolean_t       bEnDeadTime;      ///< 刹车时CHA端口状态设置
    uint8_t         u8DeadTimeValue;  ///< 刹车时CHA端口状态设置
}stc_bt_m23_dt_config_t;

/**
 ******************************************************************************
 ** \brief 触发ADC配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_bt_m23_adc_trig_config
{
    boolean_t     bEnTrigADC;          ///< 触发ADC全局控制
    boolean_t     bEnUevTrigADC;       ///< 事件更新触发ADC
    boolean_t     bEnCH0ACmpTrigADC;   ///< CH0A比较匹配触发ADC
    boolean_t     bEnCH0BCmpTrigADC;   ///< CH0B比较匹配触发ADC
}stc_bt_m23_adc_trig_config_t;

/**
 ******************************************************************************
 ** \brief  DMA触发 配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_bt_m23_trig_dma_config
{
    boolean_t              bUevTrigDMA;      ///< 更新 触发DMA使能
    boolean_t              bTITrigDMA;       ///< Trig 触发DMA功能
    boolean_t              bCmpATrigDMA;     ///< A捕获比较触发DMA使能
    boolean_t              bCmpBTrigDMA;     ///< B捕获比较触发DMA使能
    en_bt_m23_mscr_ccds_t  enCmpUevTrigDMA;  ///< 比较模式下DMA比较触发选择
}stc_bt_m23_trig_dma_config_t;

/**
 ******************************************************************************
 ** \brief  主从模式 配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_bt_m23_master_slave_config
{
    en_bt_m23_mscr_msm_t      enMasterSlaveSel;  ///< 主从模式选择
    en_bt_m23_mscr_mms_t      enMasterSrc;       ///< 主模式触发源选择
    en_bt_m23_mscr_sms_t      enSlaveModeSel;    ///< 从模式选择
    en_bt_mscr_ts_t           enTsSel;           ///< 触发输入源选择
}stc_bt_m23_master_slave_config_t;

/**
 ******************************************************************************
 ** \brief  OCREF清除功能 配置结构体定义(模式23)
 *****************************************************************************/
typedef struct stc_bt_m23_OCREF_Clr_config
{
    en_bt_m23ce_occs_t       enOCRefClrSrcSel;  ///< OCREF清除源选择
    boolean_t                bVCClrEn;          ///< 是否使能来自VC的OCREF_Clr
}stc_bt_m23_OCREF_Clr_config_t;

